Revit 2027 API
IExternalApplication Interface
An interface that supports addition of external applications to Revit.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public interface IExternalApplication
Public Interface IExternalApplication
public interface class IExternalApplication
type IExternalApplication = interface end
The IExternalApplication type exposes the following members.
Methods
Name | Description
OnShutdown | Implement this method to execute some tasks when Autodesk Revit shuts down.
OnStartup | Implement this method to execute some tasks when Autodesk Revit starts.
Top
Remarks
External applications are permitted to customize the Revit UI, and to add events and updaters to the session.
See Also
Reference
Autodesk.Revit.UI Namespace